<div dir="rtl">

#   پروژه 1

</div>

In [1]:
import pandas as pd

In [2]:
# Load financial data from a CSV file
financial_data = pd.read_csv('financial_data.csv')

# Display initial information about the data
print(financial_data.head())

         Date  Price  Volume
0  2022-01-01    100    1000
1  2022-01-02    105    1500
2  2022-01-03     98    1200
3  2022-01-04    102    1800
4  2022-01-05     99     900

In [5]:
financial_data.describe()

            Price      Volume
count    5.000000     5.00000
mean   100.800000  1280.00000
std      2.774887   370.13511
min     98.000000   900.00000
25%     99.000000  1000.00000
50%    100.000000  1200.00000
75%    102.000000  1500.00000
max    105.000000  1800.00000

In [4]:
# Simple data analysis
mean_price = financial_data['Price'].mean()
max_volume = financial_data['Volume'].max()
min_price = financial_data['Price'].min()

print('Mean Price:', mean_price)
print('Maximum Trading Volume:', max_volume)
print('Minimum Price:', min_price)

Mean Price: 100.8
Maximum Trading Volume: 1800
Minimum Price: 98

In [9]:
financial_data.loc[2,'Price']

98

In [8]:
financial_data

         Date  Price  Volume
0  2022-01-01    100    1000
1  2022-01-02    105    1500
2  2022-01-03     98    1200
3  2022-01-04    102    1800
4  2022-01-05     99     900

In [10]:
financial_data.iloc[[0,2,3]]

         Date  Price  Volume
0  2022-01-01    100    1000
2  2022-01-03     98    1200
3  2022-01-04    102    1800

In [12]:
financial_data[['Date','Volume']]

         Date  Volume
0  2022-01-01    1000
1  2022-01-02    1500
2  2022-01-03    1200
3  2022-01-04    1800
4  2022-01-05     900